# IsAcceptableParamIdAndCategoryId Method (ElementId, ElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..IsAcceptableParamIdAndCategoryId Method (ElementId, ElementId)
TableSectionData Class See Also
---
Identifies if the given parameter id and category id can be assigned to a cell in this table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsAcceptableParamIdAndCategoryId(
	ElementId paramId,
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Function IsAcceptableParamIdAndCategoryId ( _
	paramId As ElementId, _
	categoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAcceptableParamIdAndCategoryId(
	ElementId^ paramId,
	ElementId^ categoryId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId
categoryId
    Type: Autodesk.Revit.DB..::..ElementId
# ### Return Value
True if the ParamId and CategoryId are all acceptable.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
IsAcceptableParamIdAndCategoryId Overload
Autodesk.Revit.DB Namespace